# Задание-3:
# Напишите скрипт, заполняющий указанный файл (самостоятельно задайте имя файла)
# произвольными целыми цифрами, в результате в файле должно быть
# 2500-значное произвольное число.
# Найдите и выведите самую длинную последовательность одинаковых цифр
# в вышезаполненном файле.

# from random import randint
# import re
#
# with open('file.txt', 'w') as f:
#     f.write(str(randint(10**2499, 10**2500 - 1)))
#
# with open('file.txt', 'r') as f:
#     number = f.readline()
#     nums_list = list()
#     for i in range(0, 10):
#         long_num = re.findall()
